In [23]:
import pickle
import pandas as pd

In [24]:
filename = '../../../output_data/validation/test1/sa_1-601.pkl'

In [25]:
access_areas_df = pd.read_pickle(filename)

In [26]:
access_areas_df.head()

,stop_id_source,stop_id_target,time_sec,stop_lon_target,stop_lat_target,arrival_target,stop_lon_source,stop_lat_source,departure
0,12834,12834,0.0,34.784677,32.084755,2015-12-14 07:20:45,34.784677,32.084755,2015-12-14 07:20:45
1,12834,12841,60.0,34.787875,32.084074,2015-12-14 07:19:45,34.784677,32.084755,2015-12-14 07:20:45
2,12834,12889,235.0,34.795442,32.082455,2015-12-14 07:24:50,34.784677,32.084755,2015-12-14 07:28:45
3,12834,12962,1359.0,34.844303,32.076767,2015-12-14 07:06:06,34.784677,32.084755,2015-12-14 07:28:45
4,12834,12979,1285.0,34.845456,32.082794,2015-12-14 07:07:20,34.784677,32.084755,2015-12-14 07:28:45

In [27]:
single_source_aa_df = access_areas_df[access_areas_df['stop_id_source'] == 25123]

In [28]:
single_source_aa_df.head()

,stop_id_source,stop_id_target,time_sec,stop_lon_target,stop_lat_target,arrival_target,stop_lon_source,stop_lat_source,departure
989,25123,25123,0.0,34.849426,32.050923,2015-12-14 07:17:00,34.849426,32.050923,2015-12-14 07:17:00

In [29]:
single_source_aa_df.to_csv('../../../output_data/sp/csv/aa_5-556_from_stop_775.csv')

In [10]:
single_source_aa_df.shape

(15, 9)

In [11]:
single_source_aa_df.head()

,stop_id_source,stop_id_target,time_sec,stop_lon_target,stop_lat_target,arrival_target,stop_lon_source,stop_lat_source,departure
0,775,775,0.0,34.774177,32.017504,2015-12-14 07:10:36,34.774177,32.017504,2015-12-14 07:10:36
1,775,15564,790.0,34.805505,32.021799,2015-12-14 07:23:46,34.774177,32.017504,2015-12-14 07:10:36
2,775,21416,234.0,34.786839,32.017610,2015-12-14 07:14:30,34.774177,32.017504,2015-12-14 07:10:36
3,775,21475,848.0,34.802347,32.024450,2015-12-14 07:24:44,34.774177,32.017504,2015-12-14 07:10:36
4,775,21812,504.0,34.797698,32.016885,2015-12-14 07:19:00,34.774177,32.017504,2015-12-14 07:10:36